print("มีเงินอยู่ 1000 บาท ")
print("ต้องการซื้อสินค้า:หมูสับ2กิโล=300,เนื้ออกไก่=105,ไก่บ้าน(ตัว)=120,ผงทำต้มยำ= 6.50,ข้าวสาร=150,น้ำตาล=20,ปลากระป๋องสามแม่ครัว= 10,ซอสแม็กกี้ขวดเล็ก=18,ไข่แผงคละเบอร์=120.25,ชานมเย็น=21.50,Pepsi=29.50,กาแฟ=15,นมพาสเจอไรส์= 19,น้ำเปล่า=15.15,น้ำแข็ง= 10")
money=1000

หมูสับ2กิโล=300
เนื้ออกไก่=105
ไก่บ้าน=120
ผงทำต้มยำ= 6.50
ข้าวสาร=150
น้ำตาล=20
ปลากระป๋องสามแม่ครัว= 10
ซอสแม็กกี้ขวดเล็ก=18
ไข่แผงคละเบอร์=120.25
ชานมเย็น=21.50
Pepsi=29.50
กาแฟ=15
นมพาสเจอไรส์= 19
น้ำเปล่า=15.15
น้ำแข็ง= 10

price=(หมูสับ2กิโล+เนื้ออกไก่+ไก่บ้าน+ผงทำต้มยำ+ข้าวสาร+น้ำตาล+ปลากระป๋องสามแม่ครัว+ซอสแม็กกี้ขวดเล็ก+ไข่แผงคละเบอร์+ชานมเย็น+Pepsi+กาแฟ+นมพาสเจอไรส์+น้ำเปล่า+น้ำแข็ง)

print("ราคาสินค้าทั้งหมมด",price,"บาท")

torn=(money-price)
print("เงินทอน",torn,"บาท")

